Revit 2027 API
BuiltInFailures.FamilyFailures.CannotCutRefPlane Property
 Can't cut reference plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCutRefPlane { get; }
Public Shared ReadOnly Property CannotCutRefPlane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCutRefPlane {
	FailureDefinitionId^ get ();
}
static member CannotCutRefPlane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace